Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC4.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGAWBR_cm33_core1
**                          MIMXRT735SGAWBR_ezhv
**                          MIMXRT735SGAWBR_hifi1
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGFOB_cm33_core1
**                          MIMXRT735SGFOB_ezhv
**                          MIMXRT735SGFOB_hifi1
**                          MIMXRT758SGAWBR_cm33_core0
**                          MIMXRT758SGAWBR_cm33_core1
**                          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGAWBR_hifi1
**                          MIMXRT758SGFOB_cm33_core0
**                          MIMXRT758SGFOB_cm33_core1
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGFOB_hifi1
**                          MIMXRT798SGAWBR_cm33_core0
**                          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGAWBR_ezhv
**                          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_cm33_core0
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGFOB_ezhv
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGFOB_hifi4
**
**     Version:             rev. 4.0, 2025-06-06
**     Build:               b250606
**
**     Abstract:
**         CMSIS Peripheral Access Layer for AHBSC4
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**
** ###################################################################
*/

/*!
 * @file PERI_AHBSC4.h
 * @version 4.0
 * @date 2025-06-06
 * @brief CMSIS Peripheral Access Layer for AHBSC4
 *
 * CMSIS Peripheral Access Layer for AHBSC4
 */

#if !defined(PERI_AHBSC4_H_)
#define PERI_AHBSC4_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWBR_cm33_core0) || defined(CPU_MIMXRT735SGFOB_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_cm33_core1) || defined(CPU_MIMXRT735SGFOB_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_ezhv) || defined(CPU_MIMXRT735SGFOB_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_hifi1) || defined(CPU_MIMXRT735SGFOB_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core0) || defined(CPU_MIMXRT758SGFOB_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core1) || defined(CPU_MIMXRT758SGFOB_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_ezhv) || defined(CPU_MIMXRT758SGFOB_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_hifi1) || defined(CPU_MIMXRT758SGFOB_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core0) || defined(CPU_MIMXRT798SGFOB_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core1) || defined(CPU_MIMXRT798SGFOB_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_ezhv) || defined(CPU_MIMXRT798SGFOB_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi1) || defined(CPU_MIMXRT798SGFOB_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi4) || defined(CPU_MIMXRT798SGFOB_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- AHBSC4 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC4_Peripheral_Access_Layer AHBSC4 Peripheral Access Layer
 * @{
 */

/** AHBSC4 - Size of Registers Arrays */
#define AHBSC4_EZHV_SRAM_RULE_COUNT               4u
#define AHBSC4_SRAM_0_RULE_COUNT                  4u
#define AHBSC4_SRAM_1_RULE_COUNT                  4u
#define AHBSC4_SRAM_2_RULE_COUNT                  4u
#define AHBSC4_SRAM_3_RULE_COUNT                  4u
#define AHBSC4_SRAM_4_RULE_COUNT                  4u
#define AHBSC4_SRAM_5_RULE_COUNT                  4u
#define AHBSC4_SRAM_6_RULE_COUNT                  4u
#define AHBSC4_SRAM_7_RULE_COUNT                  4u
#define AHBSC4_SRAM_8_RULE_COUNT                  4u
#define AHBSC4_SRAM_9_RULE_COUNT                  4u
#define AHBSC4_SRAM_10_RULE_COUNT                 4u
#define AHBSC4_SRAM_11_RULE_COUNT                 4u
#define AHBSC4_SRAM_12_RULE_COUNT                 4u
#define AHBSC4_SRAM_13_RULE_COUNT                 4u
#define AHBSC4_SRAM_14_RULE_COUNT                 4u
#define AHBSC4_SRAM_15_RULE_COUNT                 4u
#define AHBSC4_SRAM_16_RULE_COUNT                 4u
#define AHBSC4_SRAM_17_RULE_COUNT                 4u
#define AHBSC4_SRAM_18_RULE_COUNT                 4u
#define AHBSC4_SRAM_19_RULE_COUNT                 4u
#define AHBSC4_SRAM_20_RULE_COUNT                 4u
#define AHBSC4_SRAM_21_RULE_COUNT                 4u
#define AHBSC4_SRAM_22_RULE_COUNT                 4u
#define AHBSC4_SRAM_23_RULE_COUNT                 4u
#define AHBSC4_SRAM_24_RULE_COUNT                 4u
#define AHBSC4_SRAM_25_RULE_COUNT                 4u
#define AHBSC4_SRAM_26_RULE_COUNT                 4u
#define AHBSC4_SRAM_27_RULE_COUNT                 4u
#define AHBSC4_SRAM_28_RULE_COUNT                 4u
#define AHBSC4_SRAM_29_RULE_COUNT                 4u
#define AHBSC4_XSPI2_REGION0_RULE_COUNT           4u
#define AHBSC4_XSPI2_REGION1_5_MEM_RULE_COUNT     5u
#define AHBSC4_SEC_VIO_ADDRN_COUNT                13u
#define AHBSC4_SEC_VIO_MISC_INFON_COUNT           13u

/** AHBSC4 - Register Layout Typedef */
typedef struct {
  __IO uint32_t AHB_PERIPHERAL_SLAVE_P0_SLAVE_RULE0; /**< AHB peripheral 0 Rule Register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  __IO uint32_t AHB_SECURE_CTRL_PERIPHERAL_RULE0;  /**< AHB Secure Control Peripheral Rule Register 0, offset: 0x10 */
       uint8_t RESERVED_1[12];
  __IO uint32_t AIPS4_BRIDGE_MEM_RULE0;            /**< AIPS4 Bridge Rule Register 0, offset: 0x20 */
  __IO uint32_t AIPS4_BRIDGE_MEM_RULE1;            /**< AIPS4 Bridge Rule Register 1, offset: 0x24 */
       uint8_t RESERVED_2[8];
  __IO uint32_t AHB_PERIPHERAL_SLAVE_P1_SLAVE_RULE0; /**< AHB peripheral 1 Rule Register, offset: 0x30 */
       uint8_t RESERVED_3[28];
  __IO uint32_t MEDIA_APB_SLAVE_GROUP0_RULE0;      /**< APB Bridge Peripheral 0 Rule 0, offset: 0x50 */
  __IO uint32_t MEDIA_APB_SLAVE_GROUP0_RULE1;      /**< APB Bridge Peripheral 0 Rule Register 1, offset: 0x54 */
       uint8_t RESERVED_4[24];
  __IO uint32_t EZHV_SRAM_RULE[AHBSC4_EZHV_SRAM_RULE_COUNT]; /**< EZHV SRAM Rule Register, array offset: 0x70, array step: 0x4 */
  __IO uint32_t SRAM_0_RULE[AHBSC4_SRAM_0_RULE_COUNT]; /**< RAM partition 0 Memory Rule Register, array offset: 0x80, array step: 0x4 */
  __IO uint32_t SRAM_1_RULE[AHBSC4_SRAM_1_RULE_COUNT]; /**< RAM partition 1 Memory Rule Register, array offset: 0x90, array step: 0x4 */
  __IO uint32_t SRAM_2_RULE[AHBSC4_SRAM_2_RULE_COUNT]; /**< RAM partition 2 Memory Rule Register, array offset: 0xA0, array step: 0x4 */
  __IO uint32_t SRAM_3_RULE[AHBSC4_SRAM_3_RULE_COUNT]; /**< RAM partition 3 Memory Rule Register, array offset: 0xB0, array step: 0x4 */
  __IO uint32_t SRAM_4_RULE[AHBSC4_SRAM_4_RULE_COUNT]; /**< RAM partition 4 Memory Rule Register, array offset: 0xC0, array step: 0x4 */
  __IO uint32_t SRAM_5_RULE[AHBSC4_SRAM_5_RULE_COUNT]; /**< RAM partition 5 Memory Rule Register, array offset: 0xD0, array step: 0x4 */
  __IO uint32_t SRAM_6_RULE[AHBSC4_SRAM_6_RULE_COUNT]; /**< RAM partition 6 Memory Rule Register, array offset: 0xE0, array step: 0x4 */
  __IO uint32_t SRAM_7_RULE[AHBSC4_SRAM_7_RULE_COUNT]; /**< RAM partition 7 Memory Rule Register, array offset: 0xF0, array step: 0x4 */
  __IO uint32_t SRAM_8_RULE[AHBSC4_SRAM_8_RULE_COUNT]; /**< RAM partition 8 Memory Rule Register, array offset: 0x100, array step: 0x4 */
  __IO uint32_t SRAM_9_RULE[AHBSC4_SRAM_9_RULE_COUNT]; /**< RAM partition 9 Memory Rule Register, array offset: 0x110, array step: 0x4 */
  __IO uint32_t SRAM_10_RULE[AHBSC4_SRAM_10_RULE_COUNT]; /**< RAM partition 10 Memory Rule Register, array offset: 0x120, array step: 0x4 */
  __IO uint32_t SRAM_11_RULE[AHBSC4_SRAM_11_RULE_COUNT]; /**< RAM partition 11 Memory Rule Register, array offset: 0x130, array step: 0x4 */
  __IO uint32_t SRAM_12_RULE[AHBSC4_SRAM_12_RULE_COUNT]; /**< RAM partition 12 Memory Rule Register, array offset: 0x140, array step: 0x4 */
  __IO uint32_t SRAM_13_RULE[AHBSC4_SRAM_13_RULE_COUNT]; /**< RAM partition 13 Memory Rule Register, array offset: 0x150, array step: 0x4 */
  __IO uint32_t SRAM_14_RULE[AHBSC4_SRAM_14_RULE_COUNT]; /**< RAM partition 14 Memory Rule Register, array offset: 0x160, array step: 0x4 */
  __IO uint32_t SRAM_15_RULE[AHBSC4_SRAM_15_RULE_COUNT]; /**< RAM partition 15 Memory Rule Register, array offset: 0x170, array step: 0x4 */
  __IO uint32_t SRAM_16_RULE[AHBSC4_SRAM_16_RULE_COUNT]; /**< RAM partition 16 Memory Rule Register, array offset: 0x180, array step: 0x4 */
  __IO uint32_t SRAM_17_RULE[AHBSC4_SRAM_17_RULE_COUNT]; /**< RAM partition 17 Memory Rule Register, array offset: 0x190, array step: 0x4 */
  __IO uint32_t SRAM_18_RULE[AHBSC4_SRAM_18_RULE_COUNT]; /**< RAM partition 18 Memory Rule Register, array offset: 0x1A0, array step: 0x4 */
  __IO uint32_t SRAM_19_RULE[AHBSC4_SRAM_19_RULE_COUNT]; /**< RAM partition 19 Memory Rule Register, array offset: 0x1B0, array step: 0x4 */
  __IO uint32_t SRAM_20_RULE[AHBSC4_SRAM_20_RULE_COUNT]; /**< RAM partition 20 Memory Rule Register, array offset: 0x1C0, array step: 0x4 */
  __IO uint32_t SRAM_21_RULE[AHBSC4_SRAM_21_RULE_COUNT]; /**< RAM partition 21 Memory Rule Register, array offset: 0x1D0, array step: 0x4 */
  __IO uint32_t SRAM_22_RULE[AHBSC4_SRAM_22_RULE_COUNT]; /**< RAM partition 22 Memory Rule Register, array offset: 0x1E0, array step: 0x4 */
  __IO uint32_t SRAM_23_RULE[AHBSC4_SRAM_23_RULE_COUNT]; /**< RAM partition 23 Memory Rule Register, array offset: 0x1F0, array step: 0x4 */
  __IO uint32_t SRAM_24_RULE[AHBSC4_SRAM_24_RULE_COUNT]; /**< RAM partition 24 Memory Rule Register, array offset: 0x200, array step: 0x4 */
  __IO uint32_t SRAM_25_RULE[AHBSC4_SRAM_25_RULE_COUNT]; /**< RAM partition 25 Memory Rule Register, array offset: 0x210, array step: 0x4 */
  __IO uint32_t SRAM_26_RULE[AHBSC4_SRAM_26_RULE_COUNT]; /**< RAM partition 26 Memory Rule Register, array offset: 0x220, array step: 0x4 */
  __IO uint32_t SRAM_27_RULE[AHBSC4_SRAM_27_RULE_COUNT]; /**< RAM partition 27 Memory Rule Register, array offset: 0x230, array step: 0x4 */
  __IO uint32_t SRAM_28_RULE[AHBSC4_SRAM_28_RULE_COUNT]; /**< RAM partition 28 Memory Rule Register, array offset: 0x240, array step: 0x4 */
  __IO uint32_t SRAM_29_RULE[AHBSC4_SRAM_29_RULE_COUNT]; /**< RAM partition 29 Memory Rule Register, array offset: 0x250, array step: 0x4 */
  __IO uint32_t XSPI2_REGION0_MEM_RULE[AHBSC4_XSPI2_REGION0_RULE_COUNT]; /**< XSPI2 Region0 Memory Rule Register, array offset: 0x260, array step: 0x4 */
  struct {                                         /* offset: 0x270, array step: 0x10 */
    __IO uint32_t XSPI2_REGION_MEM_RULE0;            /**< XSPI2 Region 1 Memory Rule Register..XSPI2 Region 5 Memory Rule Register, array offset: 0x270, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } XSPI2_REGION1_5_MEM_RULE[AHBSC4_XSPI2_REGION1_5_MEM_RULE_COUNT];
       uint8_t RESERVED_5[2880];
  __I  uint32_t SEC_VIO_ADDR[AHBSC4_SEC_VIO_ADDRN_COUNT]; /**< Security Violation Address, array offset: 0xE00, array step: 0x4 */
       uint8_t RESERVED_6[76];
  __I  uint32_t SEC_VIO_MISC_INFO[AHBSC4_SEC_VIO_MISC_INFON_COUNT]; /**< Security Violation Miscellaneous Information at Address, array offset: 0xE80, array step: 0x4 */
       uint8_t RESERVED_7[76];
  __IO uint32_t SEC_VIO_INFO_VALID;                /**< Security Violation Info Validity for Address, offset: 0xF00 */
       uint8_t RESERVED_8[204];
  __IO uint32_t MASTER_SEC_LEVEL;                  /**< Master Secure Level, offset: 0xFD0 */
  __IO uint32_t MASTER_SEC_ANTI_POL_REG;           /**< Master Secure Level, offset: 0xFD4 */
       uint8_t RESERVED_9[32];
  __IO uint32_t MISC_CTRL_DP_REG;                  /**< Secure Control Duplicate, offset: 0xFF8 */
  __IO uint32_t MISC_CTRL_REG;                     /**< Secure Control, offset: 0xFFC */
} AHBSC4_Type;

/* ----------------------------------------------------------------------------
   -- AHBSC4 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC4_Register_Masks AHBSC4 Register Masks
 * @{
 */

/*! @name AHB_PERIPHERAL_SLAVE_P0_SLAVE_RULE0 - AHB peripheral 0 Rule Register */
/*! @{ */

