Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_AHBSC4.h
#define AHBSC4_MASTER_SEC_LEVEL_LCDIF_MASK       (0xC00U)
#define AHBSC4_MASTER_SEC_LEVEL_LCDIF_SHIFT      (10U)
/*! LCDIF - LCDIF
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC4_MASTER_SEC_LEVEL_LCDIF(x)         (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_LEVEL_LCDIF_SHIFT)) & AHBSC4_MASTER_SEC_LEVEL_LCDIF_MASK)

#define AHBSC4_MASTER_SEC_LEVEL_GPU_MASK         (0x3000U)
#define AHBSC4_MASTER_SEC_LEVEL_GPU_SHIFT        (12U)
/*! GPU - GPU
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC4_MASTER_SEC_LEVEL_GPU(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_LEVEL_GPU_SHIFT)) & AHBSC4_MASTER_SEC_LEVEL_GPU_MASK)

#define AHBSC4_MASTER_SEC_LEVEL_JPEG_MASK        (0xC000U)
#define AHBSC4_MASTER_SEC_LEVEL_JPEG_SHIFT       (14U)
/*! JPEG - JPEG
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC4_MASTER_SEC_LEVEL_JPEG(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_LEVEL_JPEG_SHIFT)) & AHBSC4_MASTER_SEC_LEVEL_JPEG_MASK)

#define AHBSC4_MASTER_SEC_LEVEL_PNG_MASK         (0x30000U)
#define AHBSC4_MASTER_SEC_LEVEL_PNG_SHIFT        (16U)
/*! PNG - PNG
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC4_MASTER_SEC_LEVEL_PNG(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_LEVEL_PNG_SHIFT)) & AHBSC4_MASTER_SEC_LEVEL_PNG_MASK)
/*! @} */

/*! @name MASTER_SEC_ANTI_POL_REG - Master Secure Level */
/*! @{ */

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_EZHV_MASK (0x3U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_EZHV_SHIFT (0U)
/*! EZHV - EZHV
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_EZHV(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_EZHV_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_EZHV_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC0_MASK (0xCU)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC0_SHIFT (2U)
/*! SDHC0 - SDHC0
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC0(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC0_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC0_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC1_MASK (0x30U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC1_SHIFT (4U)
/*! SDHC1 - SDHC1
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC1(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC1_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_SDHC1_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB0_MASK (0xC0U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB0_SHIFT (6U)
/*! USB0 - USB0
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB0(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_USB0_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_USB0_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB1_MASK (0x300U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB1_SHIFT (8U)
/*! USB1 - USB1
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_USB1(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_USB1_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_USB1_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_LCDIF_MASK (0xC00U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_LCDIF_SHIFT (10U)
/*! LCDIF - LCDIF
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_LCDIF(x)  (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_LCDIF_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_LCDIF_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_GPU_MASK  (0x3000U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_GPU_SHIFT (12U)
/*! GPU - GPU
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_GPU(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_GPU_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_GPU_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_JPEG_MASK (0xC000U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_JPEG_SHIFT (14U)
/*! JPEG - JPEG
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_JPEG(x)   (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_JPEG_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_JPEG_MASK)

#define AHBSC4_MASTER_SEC_ANTI_POL_REG_PNG_MASK  (0x30000U)
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_PNG_SHIFT (16U)
/*! PNG - PNG
 *  0b00..Secure and privileged Master
 *  0b01..Secure and non-privileged Master
 *  0b10..Non-secure and privileged Master
 *  0b11..Non-secure and non-privileged Master
 */
#define AHBSC4_MASTER_SEC_ANTI_POL_REG_PNG(x)    (((uint32_t)(((uint32_t)(x)) << AHBSC4_MASTER_SEC_ANTI_POL_REG_PNG_SHIFT)) & AHBSC4_MASTER_SEC_ANTI_POL_REG_PNG_MASK)
/*! @} */

